Transmitter.Tests/src/InformationRegisters/ВнешниеЗапросы/ВнешниеЗапросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0f493aac-a55c-4297-b77f-b63ab42dc37e">
  <name>ВнешниеЗапросы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="4773d106-7e31-4ba1-8475-b868984cedf4">
    <name>Data</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes extendedConfigurationObject="4a606aac-354d-403b-acec-f6d099ce300a">
    <name>Сообщение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions extendedConfigurationObject="c9166ddb-3b90-4103-a795-5b301304f6d4">
    <name>Обработчик</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ОбработчикиВнешнихЗапросов</types>
    </type>
  </dimensions>
  <dimensions extendedConfigurationObject="228bede1-2c6c-4420-9c89-db095fa86a11">
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.ИдентификаторКоммита</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Transmitter.Tests/src/InformationRegisters/ВнешниеЗапросы/ManagerModule.bsl
&Вместо("ЗаписатьДанные")
Процедура Мок_ЗаписатьДанные(Знач Обработчик, Знач Идентификатор, Знач Данные, Знач Комментарий, Знач Дата)

	ПараметрыМетода = ОМ_Тесты.Мокито().МассивПараметров(Обработчик, Идентификатор, Данные, Комментарий, Дата);
	
	ПрерватьВыполнение = Ложь;
	ОМ_Тесты.Мокито().АнализВызова(РегистрыСведений.ВнешниеЗапросы, "ЗаписатьДанные", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		ПродолжитьВызов(Обработчик, Идентификатор, Данные, Комментарий, Дата);
	КонецЕсли;

КонецПроцедуры

&Вместо("НайтиДанные")
Функция Мок_НайтиДанные(Знач Обработчик, Знач Идентификатор) Экспорт

	ПараметрыМетода = ОМ_Тесты.Мокито().МассивПараметров(Обработчик, Идентификатор);
	
	ПрерватьВыполнение = Ложь;
	Результат = ОМ_Тесты.Мокито().АнализВызова(Регистрысведений.ВнешниеЗапросы, "НайтиДанные", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(Обработчик, Идентификатор);
	Иначе
		Возврат Результат;
	КонецЕсли;

КонецФункции
